<?php
declare(strict_types=1);

namespace App\Services;

/**
 * Class UefaService
 * @package App\Services
 */
class UefaService
{
    /**
     * @var string $sourceData
     */
    private string $sourceData = '';

    /**
     * @var array $data
     */
    private array $data = [];

    public function __construct()
    {
        $this->prepareData();
    }

    /**
     * @return void
     */
    private function prepareData(): void
    {
        $this->setSourceData();

        $data = explode("\n", $this->sourceData);
        foreach ($data as $key => $value) {
            $value = $this->clearNumericItem($value);
            $value = explode(' ', $value);
            $value = $this->implodeItem($value);

            $offset = -6;
            if ('.' == substr($value[1], -9, 1)) {
                $offset = -5;
            }

            $value[1] = substr($value[1], $offset);
            $data[$key] = $value;
        }

        usort($data, function ($a, $b) {
            return $a[1] > $b[1] ? -1 : 1;
        });

        $this->data = $data;
    }

    /**
     * @return void
     */
    private function setSourceData(): void
    {
        $this->sourceData = '1Англия Англия91.6788/818.57124.35721.00023.0004.750
2Испания Испания78.4897/818.92819.50018.42816.5715.062
3Италия Италия73.9098/814.92816.28515.71422.3574.625
4Германия Германия71.9097/718.71415.21416.21417.1254.642
5Нидерланды Нидерланды56.5004/59.4009.20019.20013.5005.200
6Франция Франция54.8316/611.6667.91618.41612.5834.250
7Португалия Португалия49.3164/610.3009.60012.91612.5004.000
8Бельгия Бельгия40.4005/57.6006.0006.60014.2006.000
9Турция Турция34.8503/45.0003.1006.70011.8008.250
10Шотландия Шотландия32.2503/59.7508.5007.9003.5002.600
11Австрия Австрия30.8003/55.8006.70010.4004.9003.000
12Швейцария Швейцария30.5753/56.4005.1257.7508.5002.800
13Сербия Сербия27.7753/56.0005.5009.5005.3751.400
14Дания Дания27.7002/45.1254.1257.8005.9004.750
15Чехия Чехия27.5503/42.5006.6006.7006.7505.000
16Норвегия Норвегия26.8752/43.7506.5007.6255.7503.250
17Украина Украина26.6002/57.2006.8004.2005.7002.700
18Израиль Израиль26.3752/42.3757.0006.7506.2504.000
19Греция Греция25.3254/54.9005.1008.0002.1255.200
20Хорватия Хорватия23.0251/44.3755.9006.0003.3753.375
21Польша Польша22.8752/42.1254.0004.6257.7504.375
22Кипр Кипр21.8501/45.1254.0004.1255.1003.500
23Швеция Швеция21.5001/45.7502.5005.1256.2501.875
24Румыния Румыния21.3750/45.8753.7502.2506.2503.250
25Венгрия Венгрия20.3751/44.5004.2502.7505.8753.000
26Россия Россия18.632/4.6664.3335.3004.3330.000
27Словакия Словакия18.3752/43.0001.5004.1256.0003.750
28Болгария Болгария18.3751/44.1254.0003.3754.5002.375
29Азербайджан Азербайджан17.8751/43.3752.5004.3754.0003.625
30Молдавия Молдавия12.8751/40.7501.3755.2503.7501.750
31Словения Словения12.2501/42.0002.2503.0002.1252.875
32Косово Косово11.2911/41.5001.8332.3332.8752.750
33Ирландия Ирландия10.8750/41.2501.8752.8753.3751.500
34Финляндия Финляндия10.8751/41.6251.3753.7502.6251.500
35Казахстан Казахстан10.7501/43.3751.0002.8751.1252.375
36Армения Армения10.6250/42.7501.3751.8752.3752.250
37Латвия Латвия10.6250/42.2501.3752.6252.7501.625
38Лихтенштейн Лихтенштейн10.0000/12.5000.5000.0006.5000.500
39Фарерские острова Фарерские острова9.8751/41.1252.7501.5002.2502.250
40Босния и Герцеговина Босния и Герцеговина9.7502/41.5002.6251.6252.0002.000
41Исландия Исландия9.5831/30.6250.6251.5003.0003.833
42Северная Ирландия Северная Ирландия9.2080/42.3752.8331.6251.2501.125
43Люксембург Люксембург8.6250/43.0001.0001.2501.1252.250
44Литва Литва8.5000/41.6251.6251.7502.3751.125
45Мальта Мальта8.2500/40.7501.5001.8752.6251.500
46Грузия Грузия7.6250/42.2501.7501.2501.1251.250
47Албания Албания7.3751/40.7502.0001.6250.8752.125
48Эстония Эстония7.2070/40.8751.3753.6661.1660.125
49Белоруссия Белоруссия6.6250/42.5001.5000.2500.6251.750
50Северная Македония Северная Македония6.0000/40.5001.7500.6251.6251.500
51Андорра Андорра5.9980/31.5000.6661.5000.6661.666
52Уэльс Уэльс5.7910/41.0001.5001.5001.1660.625
53Черногория Черногория5.7080/31.0001.6250.7501.0001.333
54Гибралтар Гибралтар4.9570/31.0001.6661.2500.8750.166
55Сан-Марино Сан-Марино1.8320/30.0000.5000.1660.8330.333';
    }

    /**
     * @param string $item
     * @return string
     */
    private function clearNumericItem(string $item): string
    {
        if (!is_numeric($item[0])) {
            return $item;
        }
        $item = substr($item, 1);
        return $this->clearNumericItem($item);
    }

    /**
     * @param array $item
     * @return array
     */
    private function implodeItem(array $item): array
    {
        if (4 == count($item)) {
            $result[0] = $item[0] . ' ' . $item[1];
            $result[1] = $item[2] . ' ' . $item[3];
            $item = $result;
        } elseif (6 == count($item)) {
            $result[0] = $item[0] . ' ' . $item[1] . ' ' . $item[2];
            $result[1] = $item[3] . ' ' . $item[4] . ' ' . $item[5];
            $item = $result;
        }

        return $item;
    }

    /**
     * @return array
     */
    public function getData(): array
    {
        return $this->data;
    }
}
